E2EClient/request/1485167050/01_customer_create.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns="http://webservice" xmlns:m1="java:xml_soapadapter">
  <soapenv:Body>
<customerCreate>
<CustomerCreateIN>
    <m1:CustomerCode>1485167050028C_POM2M</m1:CustomerCode>
    <m1:AcquisitionDate>01/23/2017 11:24:43</m1:AcquisitionDate>
     <m1:Customer>
      <m1:PhyFlag>Y</m1:PhyFlag>
      <m1:Name>Customer</m1:Name>
      <m1:FirstName>Vineetha</m1:FirstName>
      <m1:Language>ENU</m1:Language>
    <m1:MarketClass>101</m1:MarketClass>
      <m1:MSegment>Top</m1:MSegment>
      <m1:OrgCode>500</m1:OrgCode>
      <m1:PhoneNum>9916842317</m1:PhoneNum>
      <m1:FaxNum>89342598</m1:FaxNum>
      <m1:EMail>NN@acc</m1:EMail>
      <m1:PersonalID>98765_123</m1:PersonalID>
    </m1:Customer>
    <m1:Address>
      <m1:StreetType>Koramangala</m1:StreetType>
      <m1:AddressNum>s</m1:AddressNum>
      <m1:Address>Bangalore</m1:Address>
      <m1:City>Bangalore</m1:City>
      <m1:ZIP>201000</m1:ZIP>
      <m1:State>karnataka</m1:State>
      <m1:Country>IT</m1:Country>
    </m1:Address> 
  </CustomerCreateIN>
</customerCreate>
 </soapenv:Body>
</soapenv:Envelope> 
